# Concatenating DataFrames

## Use concat with axis=0 to concatenate along the row axis

In [9]:
import pandas as pd

In [10]:
data_a = {'id': ['1', '2', '3'],
 'first': ['hima', 'yama', 'kuna'],
 'last': ['tiwa', 'shara', 'saina']}

In [14]:
df = pd.DataFrame(data_a,columns=['id','first','last'])
df

  id first   last
0  1  hima   tiwa
1  2  yama  shara
2  3  kuna  saina

In [15]:
data_b = {'id': ['4', '5', '6'],
 'first': ['ansha', 'gora', 'sacha'],
 'last': ['rasta', 'shara', 'rawa']}

In [16]:
df2 = pd.DataFrame(data_b,columns=['id','first','last'])
df2

  id  first   last
0  4  ansha  rasta
1  5   gora  shara
2  6  sacha   rawa

In [17]:
pd.concat([df, df2], axis=0)

  id  first   last
0  1   hima   tiwa
1  2   yama  shara
2  3   kuna  saina
0  4  ansha  rasta
1  5   gora  shara
2  6  sacha   rawa

In [18]:
pd.concat([df, df2], axis=1)

  id first   last id  first   last
0  1  hima   tiwa  4  ansha  rasta
1  2  yama  shara  5   gora  shara
2  3  kuna  saina  6  sacha   rawa